app/views/users/profile/profile_edit.html.haml

              %td{:align => "center", :valign => "middle"}
                = radio_button_tag("user_profile[img_url]","#{session[:tw_img]}", false, :onclick => 'changeProfileImg(this.value)')
---
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1 LIMIT 1

            \#{link_to "","#",:title => "title",:class => "help"}
          - Position.all.each do |p|
            %span
              = check_box_tag "user_profile[positions][]", p.id, @user_profile.user_positions.collect{|pos| pos.position.id}.include?(p.id)
---
SELECT `positions`.* FROM `positions`
SELECT `user_positions`.* FROM `user_positions` WHERE `user_positions`.`user_profile_id` = 1

          %label.field Industry
          = select_tag 'user_profile[industries][]',
              options_from_collection_for_select(Industry.all, :id, :title, (@user_profile.user_industries.blank? ? "" : @user_profile.user_industries.first.industry.id)) ,
              :style=>"width:250px;",:size=>"1"
      .rightExperience
        .darkBox.mrB10
          %h6.mrB8 Years of Experience
          - Department.all.each do |d|
---
SELECT `user_industries`.* FROM `user_industries` WHERE `user_industries`.`user_profile_id` = 1
SELECT `departments`.* FROM `departments`

                = link_to "","#",:class => "help mrT3",:title => "Help"
              = select_tag "user_profile[user_experiences][#{d.id}]", options_for_select((1..35).to_a.each { |u| [u,u] },
                  @user_profile.user_experiences.blank? ? "" : @user_profile.user_experiences.select{|user_exp| user_exp.department.id == d.id}.first.exp_in_yrs),:style => "width:162px;",:size=>"1"
        .darkBoxBottom
---
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 1 LIMIT 1
SELECT `user_experiences`.* FROM `user_experiences` WHERE `user_experiences`.`user_profile_id` = 1

          %br
          - @user_profile.user_attachments.each do |file|
---
SELECT `user_attachments`.* FROM `user_attachments` WHERE `user_attachments`.`user_profile_id` = 1

                    - when 'twitter'
                      - session[:screen_name] = (session[:screen_name].blank?)? "#{Authentication.find_by_provider_and_user_id("twitter",session["warden.user.user.key"][1][0]).screen_name}" : "#{session[:screen_name]}"
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'facebook' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1