app/controllers/users/omniauth_callbacks_controller.rb

  def facebook
    #session["token"] = request.env["omniauth.auth"].credentials.token
    auth = request.env["omniauth.auth"]
    session[:signed_in_with] = auth.provider
    session[:fb_img] = auth.info.image
    process_callback
		Authentication.find_by_provider_and_user_id(auth.provider,session["warden.user.user.key"][1][0]).update_attribute('screen_name',auth.info.name)
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`user_id` = 2 AND `authentications`.`provider` = 'twitter' LIMIT 1

  def twitter
    auth =  request.env["omniauth.auth"]
    session[:screen_name] = auth.extra.raw_info.screen_name
    session[:signed_in_with] = auth.provider
		session[:tw_img] = auth.extra.raw_info.profile_image_url
    process_callback
    Authentication.find_by_provider_and_user_id(auth.provider,session["warden.user.user.key"][1][0]).update_attribute('screen_name',session[:screen_name])
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`user_id` = 1 AND `authentications`.`provider` = 'twitter' LIMIT 1
UPDATE `users` SET `last_sign_in_at` = '2012-07-16 08:56:35', `current_sign_in_at` = '2012-07-16 10:22:42', `sign_in_count` = 69, `updated_at` = '2012-07-16 10:22:42' WHERE `users`.`id` = 1

  def callback
	  if session[:atoken].nil?
  		authentication = Authentication.find_by_provider_and_user_id('linkedin',session["warden.user.user.key"][1][0])
      authentication.update_attribute('token',params[:oauth_verifier])
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'linkedin' AND `authentications`.`user_id` = 1 LIMIT 1
UPDATE `authentications` SET `token` = '16789', `updated_at` = '2012-07-16 10:24:49' WHERE `authentications`.`id` = 36