app/controllers/users/omniauth_callbacks_controller.rb

SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'linkedin' AND `authentications`.`user_id` = 1 LIMIT 1
---
  def linkedin
		process_callback
		auth = request.env["omniauth.auth"]
    session[:signed_in_with] = auth.provider
		session[:lin_img] = auth.info.image
	  session["linkedin_auth"] = true
		session["lin_name"] = auth.info.name
		if !auth.extra.raw_info.publicProfileUrl.nil?
			session["publicProfileUrl"] = auth.extra.raw_info.publicProfileUrl
		else
			session["publicProfileUrl"] = "#"
		end
		session[:lin_token] = auth.credentials.token
		session[:lin_secret] = auth.credentials.secret
		Authentication.find_by_provider_and_user_id(auth.provider,session["warden.user.user.key"][1][0]).update_attribute('screen_name',auth.info.name)