app/controllers/users/other_score_controller.rb

SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'twitter' AND `authentications`.`user_id` = 1 LIMIT 1
---
  def klout_score
    Klout.api_key = "9wvktmm43dsc7rmatmhwhksh"
    auth = Authentication.find_by_provider_and_user_id('twitter',session["warden.user.user.key"][1][0])

SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'twitter' AND `authentications`.`user_id` = 1 LIMIT 1
---
  def kred_score
    auth = Authentication.find_by_provider_and_user_id('twitter',session["warden.user.user.key"][1][0])

SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`provider` = 'twitter' AND `authentications`.`user_id` = 1 LIMIT 1
---
  def peerindex
    auth = Authentication.find_by_provider_and_user_id('twitter',session["warden.user.user.key"][1][0])