app/controllers/users/profile_controller.rb

  def index
    @providers = current_user.authentications.select(:provider).map {|a| a.provider}
---
SELECT provider FROM `authentications` WHERE `authentications`.`user_id` = 1

  def profile_edit
#	  user =  FbGraph::User.me(Authentication.find_by_provider_and_user_id(:facebook,current_user.id).token).fetch.picture
#	  render :text => user.inspect and return false
	  #  render :text => FbGraph::User.me(Authentication.find_by_provider_and_user_id(:facebook,current_user.id).token).picture.inspect and return false
    @providers = current_user.authentications.select(:provider).map {|a| a.provider}
		@departments = Department.all
    @positions = Position.all
    @industries = Industry.all
  #  render :text => current_user.user_profile.img_url.inspect and return false
    if @providers.include?("facebook")
	    session[:fb_img] = FbGraph::User.me(Authentication.find_by_provider_and_user_id(:facebook,current_user.id).token).fetch.picture
	    session[:fb_profile_img] =  session[:fb_img]+"?type=large"
    else
	    session[:fb_img] =""
	    session[:fb_profile_img] = ""
    end
    if @providers.include?("linkedin")
	    authentication = Authentication.find_by_provider_and_user_id(:linkedin,current_user.id)
      client = LinkedIn::Client.new
      client.authorize_from_access(authentication.token,authentication.secret)
      session["linkedin_connections"] = client.connections.total
      @recommendations = client.profile(:fields => %w(recommendations-received)).recommendations_received.all
---
SELECT provider FROM `authentications` WHERE `authentications`.`user_id` = 1
SELECT `departments`.* FROM `departments`
SELECT `positions`.* FROM `positions`
SELECT `industries`.* FROM `industries`
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`user_id` = 1 AND `authentications`.`provider` = 'twitter' LIMIT 1
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1 LIMIT 1

  def update_profile
    is_user_pos_found = true if params[:user_profile][:positions]
    is_user_files_found = true if params[:user_profile][:user_attachments]
    is_user_exp_found = true if params[:user_profile][:user_experiences]
    is_user_ind_found = true if params[:user_profile][:industries]
		is_user_rec_found = true if params["recommendation_ids"]
    is_user_linkedin_connection_count = true if session["linkedin_connections"]
    convert_ids_to_objects(is_user_pos_found,'Position' ,:positions)
    convert_ids_to_objects(is_user_ind_found,'Industry' ,:industries)

		if is_user_linkedin_connection_count
				current_user.linkedin_count.clear
				current_user.update_linkedin(session["linkedin_connections"])
		end
		current_user.linkedin_recommendations.clear
		if is_user_rec_found
			if params["recommendation_ids"].size > 5
				flash[:notice] = "You have Selected More than 5 recommendations"
				render :action => 'update_profile'
			else
				current_user.update_linkedin_recc(params["recommendation_ids"])
			end
		end
    if is_user_exp_found
      user_exp_hash = params[:user_profile][:user_experiences]
      unless user_exp_hash.nil? && user_exp_hash.empty?
        user_exp_arr = user_exp_hash.collect do |key,val|
            UserExperience.new(department: Department.find(key), exp_in_yrs: val.to_i )
          end
        params[:user_profile].delete :user_experiences
---
SELECT `user_experiences`.* FROM `user_experiences` WHERE `user_experiences`.`user_profile_id` = 1
SELECT `user_profiles`.* FROM `user_profiles` WHERE `user_profiles`.`user_id` = 1 LIMIT 1
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 1 LIMIT 1
DELETE FROM `user_experiences` WHERE `user_experiences`.`id` = 13


    if is_user_files_found
      user_files =  params[:user_profile][:user_attachments]
      user_attachments = user_files.collect do |f|
---
SELECT `user_attachments`.* FROM `user_attachments` WHERE `user_attachments`.`user_profile_id` = 1

      @user_profile.user = current_user
    else
      @user_profile = current_user.user_profile
      @user_profile.update_attributes(params[:user_profile])
---
UPDATE `user_profiles` SET `img_url` = 'http://graph.facebook.com/1310835663/picture?type=square', `updated_at` = '2012-07-16 09:42:56' WHERE `user_profiles`.`id` = 1