app/controllers/users/profile_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def profile_edit
  	@user =  User.find(1)